Revit 2027 API
BuiltInFailures.SiteFailures.ResetToposurfacePhaseCreated Property
 The parameter Phase Created of the Toposurface is not set to the first Phase. No pre-existing toposurface were detected. The parameter will be reset to the first Phase unless Keep Phase Created option is picked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ResetToposurfacePhaseCreated { get; }
Public Shared ReadOnly Property ResetToposurfacePhaseCreated As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ResetToposurfacePhaseCreated {
	FailureDefinitionId^ get ();
}
static member ResetToposurfacePhaseCreated : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace